_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Фрагменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Фрагменты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РасценкиФрагмента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШифрРасценки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеРасценки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНормативныхСборников</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измеритель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаОбъема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Привязка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Определитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_Определители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрабатыватьПоПроекту</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Фрагменты/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы


// Команда "Вверх". 
&НаКлиенте
Процедура Вверх(Команда)
	ВверхНаСервере();
КонецПроцедуры

// Команда "Вниз".
&НаКлиенте
Процедура Вниз(Команда)
	ВнизНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если Источник = "AddIn.Base" Тогда
		Если Событие = "SelectRasc"+ИдФормы Тогда
			Структура = Новый Структура("НаименованиеРасценки,ШифрРасценки,Определитель,ЕдиницаИзмерения,Измеритель,ФормулаОбъема,ОбъемРабот,ТипНормативныхСборников");
			ЗагрузитьТекущиеДанныеВСтруктуру(Данные,Структура);
			СтрокаТЧ = Объект.РасценкиФрагмента.Добавить();
			Если Не ЗначениеЗаполнено(Структура.ФормулаОбъема) Тогда
					Структура.ФормулаОбъема = СокрЛП(Строка(Структура.ОбъемРабот));
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Структура);
			СтрокаТЧ.ОбрабатыватьПоПроекту = Истина;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

// Процедура обработки команды ВыборИзВНБ.
// Вызывается сметная компонента для выбора расценок.
&НаКлиенте
Процедура ВыборИзВНБ(Команда)
		ИдФормы = СметнаяКомпонента.ПоказатьОкноНорм("1");
КонецПроцедуры



#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

// Движение "Вверх" вместе с привязанными строками.
&НаСервере
Процедура ВверхНаСервере()
	ТабличнаяЧасть = Объект.РасценкиФрагмента;
	Строка = ТабличнаяЧасть.НайтиПоИдентификатору(Элементы.СсылкаРасценкиФрагмента.ТекущаяСтрока);
	Если Строка <> Неопределено Тогда
		Если Строка.Привязка = Истина Тогда
			Возврат;
		КонецЕсли;	
		Индекс = Строка.НомерСтроки - 1;
		Если Индекс = 0 Тогда
			Возврат;
		КонецЕсли;	
		ЧислоСвязанныхЗаСтрокой = ПолучитьЧислоСвязанных(Индекс,ТабличнаяЧасть);
		ИндексВерхнейСтроки = ?((Индекс - ЧислоСвязанныхЗаСтрокой - 1) < 0,0,(Индекс - ЧислоСвязанныхЗаСтрокой - 1));
		ЧислоСвязанныхПеред = 0;
		Если ТабличнаяЧасть[ИндексВерхнейСтроки].Привязка = Истина Тогда
			Пока 1 = 1 Цикл
				ЧислоСвязанныхПеред = ЧислоСвязанныхПеред + 1;
				ИндексВерхнейСтроки = ИндексВерхнейСтроки - 1;
				Если ТабличнаяЧасть[ИндексВерхнейСтроки].Привязка = Ложь
					Или ИндексВерхнейСтроки = 0	Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		ЧислоСдвигов = ЧислоСвязанныхПеред + ЧислоСвязанныхЗаСтрокой + 1 ;
		Если ИндексВерхнейСтроки >= 0 Тогда
			ТабличнаяЧасть.Сдвинуть(Индекс, -ЧислоСдвигов);
		КонецЕсли;
		
		Если ЧислоСвязанныхЗаСтрокой > 0 Тогда
			Для Сч =1 По ЧислоСвязанныхЗаСтрокой Цикл
				ИндексВерхнейСтроки = ИндексВерхнейСтроки - 1;
				Индекс =  Индекс + 1 ;
				Если Индекс >= 0 Тогда
					ТабличнаяЧасть.Сдвинуть(Индекс, -ЧислоСдвигов);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

// Движение "Вниз" вместе с привязанными строками. 
&НаСервере
Процедура ВнизНаСервере()
	ТабличнаяЧасть = Объект.РасценкиФрагмента;
	Строка = ТабличнаяЧасть.НайтиПоИдентификатору(Элементы.СсылкаРасценкиФрагмента.ТекущаяСтрока);
	
	Если Строка <> Неопределено Тогда
		Если Строка.Привязка = Истина Тогда
			Возврат;
		КонецЕсли;	
		Индекс = Строка.НомерСтроки - 1;
		ЧислоСвязанныхЗаСтрокой = ПолучитьЧислоСвязанных(Индекс,ТабличнаяЧасть);
		Если Строка.НомерСтроки + ЧислоСвязанныхЗаСтрокой = ТабличнаяЧасть.Количество() Тогда
			Возврат;
		КонецЕсли;	
		ИндексНижнейСтроки = Индекс + ЧислоСвязанныхЗаСтрокой + 1;
		ЧислоСвязанныхПеред = 0;
		Если ТабличнаяЧасть[ИндексНижнейСтроки].Привязка = Истина Тогда
			Пока 1 = 1 Цикл
				ЧислоСвязанныхПеред = ЧислоСвязанныхПеред + 1;
				ИндексНижнейСтроки = ИндексНижнейСтроки + 1;
				Если ТабличнаяЧасть[ИндексНижнейСтроки].Привязка = Ложь
					Или ИндексНижнейСтроки >= ТабличнаяЧасть.Количество() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		ЧислоСдвигов = ?((ЧислоСвязанныхПеред + ЧислоСвязанныхЗаСтрокой) = 0,1, (ЧислоСвязанныхПеред + ЧислоСвязанныхЗаСтрокой));
		Если ИндексНижнейСтроки <= ТабличнаяЧасть.Количество() Тогда
			ТабличнаяЧасть.Сдвинуть(Индекс, ЧислоСдвигов + 1);
		КонецЕсли;
		
		Если ЧислоСвязанныхЗаСтрокой > 0 Тогда
			Для Сч =1 По ЧислоСвязанныхЗаСтрокой Цикл
				Индекс =  Индекс + сч - 1;
				ИндексНижнейСтроки = Индекс + ЧислоСвязанныхЗаСтрокой + 1;
				Сдвиг =  ЧислоСдвигов + Сч ;
				Если ИндексНижнейСтроки < ТабличнаяЧасть.Количество() Тогда
					ТабличнаяЧасть.Сдвинуть(Индекс, Сдвиг );
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	

	КонецЕсли;	
	
КонецПроцедуры	

// Фукция возврашает число связанных строк с текущей рсновной строкой
&НаСервере
Функция ПолучитьЧислоСвязанных(Индекс,ТабличнаяЧасть)
	ЧислоСтрок = ТабличнаяЧасть.Количество();	
	Строка = ТабличнаяЧасть[Индекс] ;
	ИндексСтроки = Строка.НомерСтроки - 1; 
	Сч = 1;
	Для сч = 1 По ЧислоСтрок Цикл
		ИндексСтроки = ИндексСтроки + 1;
		Если ИндексСтроки = ЧислоСтрок - 1 Тогда
			Если ТабличнаяЧасть[ИндексСтроки].Привязка = Истина Тогда
			Сч = Сч + 1	
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		Если ИндексСтроки > ЧислоСтрок - 1 Тогда  Прервать;
		КонецЕсли;
		Если ТабличнаяЧасть[ИндексСтроки].Привязка = Ложь Тогда Прервать;
		КонецЕсли;
		
	КонецЦикла;
	Возврат (Сч-1);
	
КонецФункции	

// Процедура заполняет структуру из тега "norm".
&НаСервере
Процедура ПрочитатьНорм(Тег,Структура)
	Пока Тег.ПрочитатьАтрибут() Цикл
		Если Тег.Значение = " " ИЛИ Тег.Значение = "" Тогда
			Продолжить;
		КонецЕсли;
		ТегИмя = НРег(Тег.Имя);
		Если ТегИмя = "code" Тогда
			ШифрРасценки = Тег.Значение;
			Структура.ШифрРасценки = ШифрРасценки;
		ИначеЕсли ТегИмя = "name" Тогда
			Наименование = Тег.Значение;
			Структура.НаименованиеРасценки = Наименование;
		ИначеЕсли ТегИмя = "izm" Тогда
			Измеритель = Тег.Значение;	
			Структура.Измеритель = Измеритель;
		ИначеЕсли ТегИмя = "unit" Тогда
			ЕдиницаИзмерения = Справочники.СМ_ЕдиницыИзмеренияСмета.НайтиПоКоду(Число(Тег.Значение));
			Если Не ЗначениеЗаполнено(Структура.Измеритель) Тогда
				Структура.Измеритель = Тег.Значение;
			КонецЕсли;
			Структура.ЕдиницаИзмерения = ЕдиницаИзмерения;
		ИначеЕсли ТегИмя = "opr" Тогда
			Структура.Определитель = Справочники.СМ_Определители.НайтиПоКоду(Число(Тег.Значение)); 
		ИначеЕсли ТегИмя = "normtypecode" Тогда
			ТипНормативныхСборников = СМ_СметаЗагрузкаВызовСервера.ОпределитьТипНормСборникаПоКоду(Тег.Значение);
			Структура.ТипНормативныхСборников = ТипНормативныхСборников;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

// Процедура загружает данные из внешнего источника в структуру
&НаСервере
Процедура ЗагрузитьТекущиеДанныеВСтруктуру(Данные,Структура)
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Данные);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если (ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента)ИЛИ(ЧтениеXML.ТипУзла = ТипУзлаXML.Текст) Тогда
			Имя = НРег(ЧтениеXML.Имя);
			Если Имя = "collection" Тогда
			ИначеЕсли Имя = "norm" Тогда
				ПрочитатьНорм(ЧтениеXML,Структура);
			ИначеЕсли Имя = "formula" Тогда
				ЧтениеXML.Прочитать();
				ФормулаОбъема = СокрЛП(ЧтениеXML.Значение);
				Структура.ФормулаОбъема = ФормулаОбъема;
			ИначеЕсли Имя = "volume" Тогда
				ЧтениеXML.Прочитать();
				Структура.ОбъемРабот = Число(ЧтениеXML.Значение);
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры


#КонецОбласти
